t21/Walnut_X/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.11.0.pdsc
        <!-- ******************************  MKL27Z32xxx4  ****************************** -->
        <device Dname="MKL27Z32xxx4">
          <compile header="Device/Include/MKL27Z644.h"  define="MKL27Z32xxx4"/>
          <debug      svd="SVD/MKL27Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFF800"  size="0x2000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MK_P32_48MHZ_KL43.FLM"  start="0x00000000"  size="0x8000"  RAMstart="0x1FFFF800"  RAMsize="0x800"  default="1"/>
          <book name="Documents/KL27P64M48SF2RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF2.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z64xxx4  ****************************** -->
        <device Dname="MKL27Z64xxx4">
          <compile header="Device/Include/MKL27Z644.h"  define="MKL27Z64xxx4"/>
          <debug      svd="SVD/MKL27Z644.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MK_P64_48MHZ_KL43.FLM"   start="0x00000000"  size="0x10000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents/KL27P64M48SF2RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF2.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z128xxx4  ****************************** -->
        <device Dname="MKL27Z128xxx4">
          <compile header="Device/Include/MKL27Z4.h"  define="MKL27Z128xxx4"/>
          <debug      svd="SVD/MKL27Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MK_P128_48MHZ_KL43.FLM"   start="0x00000000"  size="0x20000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents/KL27P64M48SF6RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF6.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z256xxx4  ****************************** -->
        <device Dname="MKL27Z256xxx4">
          <compile header="Device/Include/MKL27Z4.h"  define="MKL27Z256xxx4"/>
          <debug      svd="SVD/MKL27Z4.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/MK_P256_48MHZ_KL43.FLM"   start="0x00000000"  size="0x40000"  RAMstart="0x1FFFF000"  RAMsize="0x800"  default="1"/>
          <book name="Documents/KL27P64M48SF6RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF6.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL28Z256xxx7  ****************************** -->
        <!--device Dname="MKL28Z256xxx7">
          <compile header="Device/Include/MKL28Z7.h"  define="MKL28Z256xxx7"/>
          <debug svd="SVD/MKL28Z7.svd"/>
          <memory     id="IROM1"                     start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory     id="IRAM1"                     start="0x1FFF8000" size="0x20000" init   ="0" default="1"/>
          <algorithm  name="Flash/MK_P256_KL28.FLM"  start="0x00000000" size="0x40000"             default="1"/>
        </device-->

        <!-- ******************************  MKL28Z512xxx7  ****************************** -->
        <device Dname="MKL28Z512xxx7">
          <compile header="Device/Include/MKL28Z7.h"  define="MKL28Z512xxx7"/>
          <debug svd="SVD/MKL28Z7.svd"/>
          <memory     id="IROM1"                     start="0x00000000" size="0x80000" startup="1" default="1"/>
          <memory     id="IRAM1"                     start="0x1FFF8000" size="0x20000" init   ="0" default="1"/>
          <algorithm  name="Flash/MK_P512_KL28.FLM"  start="0x00000000" size="0x80000"             default="1"/>
          <!--book name="Documents/KL28SINGLERM.pdf" title="KL28 Sub-Family Reference Manual"/-->
          <!--book name="Documents/KL28SINGLE.pdf"   title="KL28 Sub-Family Data Sheet"/-->
        </device>
      </subFamily>

      <!-- ******************************  KL3x    ****************************** -->
      <subFamily DsubFamily="KL3x">
        <description>
The Kinetis KL3x family of ARM Cortex-M0+ MCUs combine ultra-low-power performance with a rich suite of analog,
communication, timing and control peripherals, including a flexible, low-power segment LCD controller with support for up to 376 segments.
These features make the Kinetis KL3x family well suited for display-based applications such as electronic scales,
thermostats, flow meters and smart meters.
        </description>

        <!-- ******************************  MKL33Z32xxx4  ****************************** -->
        <device Dname="MKL33Z32xxx4">
          <compile header="Device/Include/MKL33Z644.h"  define="MKL33Z32xxx4"/>
          <debug      svd="SVD/MKL33Z644.svd"/>
          <memory     id="IROM1"                          start="0x00000000"  size="0x8000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x1FFFFC00"  size="0x1000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/MK_P32_48MHZ_KL43.FLM"  start="0x00000000"  size="0x8000"  RAMstart="0x1FFFFC00"  RAMsize="0x800"  default="1"/>
          <book name="Documents/KL13P80M48SF3RM.pdf" title="KL33 Sub-Family Reference Manual"/>
          <book name="Documents/KL33P80M48SF3.pdf"   title="KL33 Sub-Family Data Sheet"/>
        </device>

