t21/Walnut_X/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.11.0.pdsc
    <!-- Startup MKL36Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL36Z4 CMSIS">
      <description>System Startup for Freescale MKL36Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_MKL36Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL36Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL4x    ****************************** -->
    <!-- Startup MKL43Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL43Z4 CMSIS">
      <description>System Startup for Freescale MKL43Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_MKL43Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL43Z4.c"        attr="config" version="1.0.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device/Source/system_MKL43Z4.h"        attr="config" version="1.0.0"/>
      </files>
    </component>
    <!-- Startup MKL46Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKL46Z4 CMSIS">
      <description>System Startup for Freescale MKL46Z4 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_MKL46Z4.s"   attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL46Z4.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- ******************************  KL8x    ****************************** -->
    <!-- Startup MKL82Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.5.0" condition="MKL82Z7 CMSIS">
      <description>System Startup for Freescale MKL82Z7 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device/Include/"/>
        <!-- startup / system file -->
        <file category="source"  name="Device/Source/ARM/startup_MKL82Z7.s"   attr="config" version="1.5.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKL82Z7.c"        attr="config" version="1.5.0"/>
        <!-- system header file (configurable) -->
        <file category="header"  name="Device/Source/system_MKL82Z7.h"        attr="config" version="1.5.0"/>
      </files>
    </component>

    <!-- FRDM-KL25Z board support -->
    <bundle Cbundle="FRDM-KL25Z" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale FRDM-KL25Z board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL25Z4 CMSIS">
      <description>LED driver for Freescale FRDM-KL25Z board</description>
        <files>
          <file category="source" name="Boards/Freescale/FRDM-KL25Z/Common/LED_FRDM-KL25Z.c"/>
        </files>
      </component>
    </bundle>

    <!-- TWR-KL43Z48M board support -->
    <bundle Cbundle="TWR-KL43Z48M" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TWR-KL43Z48M board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL43Z4 CMSIS">
      <description>LED driver for Freescale TWR-KL43Z48M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL43Z48M/Common/LED_TWR-KL43Z48M.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKL43Z4 CMSIS">
      <description>Button driver for Freescale TWR-KL43Z48M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL43Z48M/Common/Buttons_TWR-KL43Z48M.c"/>
        </files>
      </component>
    </bundle>

    <!-- FRDM-KL43Z board support -->
    <bundle Cbundle="FRDM-KL43Z" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale FRDM-KL43Z board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL43Z4 CMSIS">
      <description>LED driver for Freescale FRDM-KL43Z board</description>
        <files>
          <file category="source" name="Boards/Freescale/FRDM-KL43Z/Common/LED_FRDM-KL43Z.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKL43Z4 CMSIS">
      <description>Button driver for Freescale FRDM-KL43Z board</description>
        <files>
          <file category="source" name="Boards/Freescale/FRDM-KL43Z/Common/Buttons_FRDM-KL43Z.c"/>
        </files>
      </component>
    </bundle>

    <!-- TWR-KL28Z72M board support -->
    <bundle Cbundle="TWR-KL28Z72M" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TWR-KL28Z72M board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL28Z7 CMSIS">
      <description>LED driver for Freescale TWR-KL28Z72M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL28Z72M/Common/LED_TWR-KL28Z72M.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKL28Z7 CMSIS">
      <description>Button driver for Freescale TWR-KL28Z72M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL28Z72M/Common/Buttons_TWR-KL28Z72M.c"/>
        </files>
      </component>
    </bundle>

    <!-- TWR-KL82Z72M board support -->
    <bundle Cbundle="TWR-KL82Z72M" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale TWR-KL82Z72M board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL82Z7 CMSIS">
      <description>LED driver for Freescale TWR-KL82Z72M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL82Z72M/Common/LED_TWR-KL82Z72M.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKL82Z7 CMSIS">
      <description>Button driver for Freescale TWR-KL82Z72M board</description>
        <files>
          <file category="source" name="Boards/Freescale/TWR-KL82Z72M/Common/Buttons_TWR-KL82Z72M.c"/>
        </files>
      </component>
    </bundle>

    <!-- FRDM-KL82Z board support -->
    <bundle Cbundle="FRDM-KL82Z" Cclass="Board Support" Cversion="1.0.0">
      <description>Freescale FRDM-KL82Z board support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="MKL82Z7 CMSIS">
      <description>LED driver for Freescale FRDM-KL82Z board</description>
        <files>
          <file category="source" name="Boards/Freescale/FRDM-KL82Z/Common/LED_FRDM-KL82Z.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKL82Z7 CMSIS">
      <description>Button driver for Freescale FRDM-KL82Z board</description>
        <files>
          <file category="source" name="Boards/Freescale/FRDM-KL82Z/Common/Buttons_FRDM-KL82Z.c"/>
        </files>
      </component>
    </bundle>
  </components>

