t21/Walnut_X/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.11.0.pdsc
  <boards>
    <board name="FRDM-KL02Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL02Z is a development tool for the 48 MHz KL02 sub-familiy of Kinetis microcontrollers.</description>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL02Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL03Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL03Z is a development tool for the 48 MHz KL03 sub-familiy of Kinetis microcontrollers.</description>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL03Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL25Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL25Z is a Freedom Development Platform for Kinetis KL14, KL15, KL24, KL25 MCUs.</description>
      <image small="Boards/Freescale/FRDM-KL25Z/Documents/FRDM-KL25Z_small.jpg"
             large="Boards/Freescale/FRDM-KL25Z/Documents/FRDM-KL25Z_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-kl14-kl15-kl24-kl25-mcus:FRDM-KL25Z" title="FRDM-KL25Z Web Page"/>
      <book category="manual"    name="Boards/Freescale/FRDM-KL25Z/Documents/FRDM-KL25Z_UM.pdf"   title="User Manual"/>
      <book category="setup"     name="Boards/Freescale/FRDM-KL25Z/Documents/FRDM-KL25Z_QSG.pdf"  title="Quick Start Guide"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL25Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="CR2032 Battery"/>
      <feature type="Button"    n="1"              name="Reset button"/>
      <feature type="USB"       n="1"              name="Full-Speed USB OTG with USB Standard-B Connector"/>
      <feature type="DIO"       n="76"             name="Arduino R3 compatible I/O connectors"/>
      <feature type="LED"       n="1"              name="Tri-color (RGB) LED"/>
      <feature type="Touch"     n="1"              name="Capacitive Touch Slider"/>
      <feature type="Accelerometer" n="1"          name="MMA8451Q 3-axis digital Accelerometer"/>
      <feature type="FreedomFF"/>
      <debugInterface adapter="OpenSDA"   connector="Mini-USB"/>
    </board>

    <board name="TWR-KL28Z72M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KL28Z72M is a development board for the 72 MHz KL28 sub-familiy of Kinetis microcontrollers.</description>
      <!--image small="Boards/Freescale/TWR-KL28Z72M/Documents/TWR-KL28Z72M_small.png"
             large="Boards/Freescale/TWR-KL28Z72M/Documents/TWR-KL28Z72M_large.png"/-->
      <!--book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KL28Z72M" title="TWR-KL28Z72M Web Page"/-->
      <!--book category="manual"    name="Boards/Freescale/TWR-KL28Z72M/Documents/TWR-KL28Z72MUG.pdf"   title="User Manual"/-->
      <!--book category="schematic" name="Boards/Freescale/TWR-KL28Z72M/Documents/TWR-KL28Z72M_SCH.pdf" title="Schematics"/-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL28Z512xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <feature type="ODbg"            n="1"        name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"             n="5"        name="USB Powered"/>
      <feature type="USB"             n="1"        name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"       n="1"        name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"       n="2"        name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"            n="1"/>      
      <feature type="Button"          n="3"/>      
      <feature type="Touch"           n="2"/>      
      <feature type="Accelerometer"   n="1"        name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"             n="4"        name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"         n="1"/>
    </board>

    <board name="TWR-KL43Z48M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KL43Z48M is a development board for the 48 MHz KL43 sub-familiy of Kinetis microcontrollers.</description>
      <image small="Boards/Freescale/TWR-KL43Z48M/Documents/TWR-KL43Z48M_small.jpg"
             large="Boards/Freescale/TWR-KL43Z48M/Documents/TWR-KL43Z48M_large.jpg"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KL43Z48M" title="TWR-KL43Z48M Web Page"/>
      <book category="setup"     name="Boards/Freescale/TWR-KL43Z48M/Documents/TWRKL43Z48MQSG.pdf"   title="TWR-KL43Z48M Quick Start Guide"/>
      <book category="manual"    name="Boards/Freescale/TWR-KL43Z48M/Documents/TWRKL43ZUG.pdf"       title="User Manual"/>
      <book category="schematic" name="Boards/Freescale/TWR-KL43Z48M/Documents/TWR-KL43Z48M_SCH.pdf" title="Schematics"/>
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL43Z256xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL4x"/>

