t21/Walnut_X/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.11.0.pdsc
      <feature type="ODbg"          n="1"     name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"     name="USB Powered"/>
      <feature type="USB"           n="1"     name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"     n="1"     name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"     n="2"     name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="ConnOther"     n="1"     name="Infrared transmit and receive"/>
      <feature type="Poti"          n="1"     name="Potentiometer for ADC measurements"/>      
      <feature type="Button"        n="3"     name="Two user, one Reset push button"/>      
      <feature type="Touch"         n="1"     name="Touch Tower plug-in socket (with TSS only)"/>      
      <feature type="LCD"           n="1"     name="Segment LCD module (TWRPI-SLCD"/>
      <feature type="Accelerometer" n="1"     name="6-Axis Xtrinsic Sensor with Integrated Linear Accelerometer and Magnetometer (FXOS8700CQ) "/>
      <feature type="LED"           n="4"     name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"       n="1"/>
    </board>

    <board name="FRDM-KL43Z" vendor="Freescale" revision="Rev. B" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL43Z is a development tool for the 48 MHz KL43 sub-familiy of Kinetis microcontrollers.</description>
      <image small="Boards/Freescale/FRDM-KL43Z/Documents/FRDM-KL43Z_small.jpg"/>
      <book category="manual"    name="Boards/Freescale/FRDM-KL43Z/Documents/FRDMKL43ZUG.pdf"    title="User Manual"/>
      <book category="schematic" name="Boards/Freescale/FRDM-KL43Z/Documents/FRDM-KL43Z_SCH.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKL43Z256xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL4x"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="3"             name="LEDs: SDA, 2x User"/>
      <feature type="CustomFF"   n="9"  m="8"      name="Individual Port Access"/>
      <feature type="ArduinoFF"  n="1"             name ="Form factor compatible with Arduino"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1" m="4.7"     name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="ODbg"       n="1"             name="Onboard OpenSDA via USB"/>
    </board>

    <board name="TWR-KL82Z72M" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The TWR-KL82Z72M is a development board for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
      <!--image small="Boards/Freescale/TWR-KL82Z72M/Documents/TWR-KL82Z72M_small.png"
             large="Boards/Freescale/TWR-KL82Z72M/Documents/TWR-KL82Z72M_large.png"/-->
      <!--book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KL28Z72M" title="TWR-KL82Z72M Web Page"/-->
      <!--book category="manual"    name="Boards/Freescale/TWR-KL82Z72M/Documents/TWR-KL82Z72MUG.pdf"   title="User Manual"/-->
      <!--book category="schematic" name="Boards/Freescale/TWR-KL82Z72M/Documents/TWR-KL82Z72M_SCH.pdf" title="Schematics"/-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL82Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL8x"/>
<!--
      <feature type="ODbg"            n="1"        name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"             n="5"        name="USB Powered"/>
      <feature type="USB"             n="1"        name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"       n="1"        name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"       n="2"        name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"            n="1"/>      
      <feature type="Button"          n="3"/>      
      <feature type="Touch"           n="2"/>      
      <feature type="Accelerometer"   n="1"        name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"             n="4"        name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"         n="1"/>
-->
    </board>

    <board name="FRDM-KL82Z" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>The FRDM-KL82Z is a development tool for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
<!--
      <image small="Boards/Freescale/FRDM-KL43Z/Documents/FRDM-KL43Z_small.jpg"/>
      <book category="manual"    name="Boards/Freescale/FRDM-KL43Z/Documents/FRDMKL43ZUG.pdf"    title="User Manual"/>
      <book category="schematic" name="Boards/Freescale/FRDM-KL43Z/Documents/FRDM-KL43Z_SCH.pdf" title="Schematics"/>
-->
      <mountedDevice deviceIndex="0" Dvendor="Freescale:78" Dname="MKL81Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KLxx Series" DsubFamily="KL8x"/>
<!--
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="3"             name="LEDs: SDA, 2x User"/>
      <feature type="CustomFF"   n="9"  m="8"      name="Individual Port Access"/>
      <feature type="ArduinoFF"  n="1"             name ="Form factor compatible with Arduino"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1" m="4.7"     name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="ODbg"       n="1"             name="Onboard OpenSDA via USB"/>
-->
    </board>

    </boards>

  <examples>
    <!-- FRDM-KL02Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KL02Z/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL02Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL03Z Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KL03Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KL03Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

