t21/Walnut_X/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.11.0.pdsc
    <!-- FRDM-KL25Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KL25Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL25Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KL43Z48M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KL43Z48M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KL43Z48M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL43Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KL43Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL43Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KL28Z72M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KL28Z72M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KL28Z72M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KL82Z72M Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/TWR-KL82Z72M/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KL82Z72M" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL82Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Freescale/FRDM-KL82Z/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL82Z" vendor="Freescale"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
